<script>
import BreadCrumb from '@/components/BreadCrumb.vue'
export default {
  name: 'PageLayout',
  components: { BreadCrumb},
  props: {
    breadcrumbs: {
      type: Array,
      required: true
    }
  }
}
</script>

<template>
  <div>
    <div class="content">
      <BreadCrumb :breadcrumbs="breadcrumbs" />
      <main>
        <h1 class="bold">
          Лицензионный договор
        </h1>

        <article class="regular">
          <h2 class="bold">Заголовок 1</h2>
          <p>
            Представленная тележка-дозатор обеспечивает высококачественную обработку любых
            территорий сыпучими противогололедными реагентами самых разных типов, включая такие
            тяжелые, как гранитная и мраморная крошка, песок и пескосоляные смеси. Тележка прекрасно
            подходит для использования во дворах многоквартирных домов, обработки территорий
            промышленных предприятий, востребована владельцами магазинов, различных коммерческих
            компаний. Кроме того, она может использоваться для высева семян на газонах, теннисных
            кортах и других территориях.
          </p>

          <p>Представленная тележка-дозатор обеспечивает высококачественную обработку любых
            территорий сыпучими противогололедными реагентами самых разных типов, включая такие
            тяжелые, как гранитная и мраморная крошка, песок и пескосоляные смеси.</p>
        </article>

        <article class="regular">
          <h2 class="bold">Заголовок 2</h2>

          <p>Представленная тележка-дозатор обеспечивает высококачественную обработку любых
            территорий сыпучими противогололедными реагентами самых разных типов, включая такие
            тяжелые, как гранитная и мраморная крошка, песок и пескосоляные смеси.</p>
        </article>

        <article class="regular">
          <h2 class="bold">Заголовок 3</h2>

          <p>Представленная тележка-дозатор обеспечивает высококачественную обработку любых
            территорий сыпучими противогололедными реагентами самых разных типов, включая такие
            тяжелые, как гранитная и мраморная крошка, песок и пескосоляные смеси. Тележка прекрасно
            подходит для использования во дворах многоквартирных домов, обработки территорий
            промышленных предприятий, востребована владельцами магазинов, различных коммерческих
            компаний. Кроме того, она может использоваться для высева семян на газонах, теннисных
            кортах и других территориях.</p>

          <p>Представленная тележка-дозатор обеспечивает высококачественную обработку любых
            территорий сыпучими противогололедными реагентами самых разных типов, включая такие
            тяжелые, как гранитная и мраморная крошка, песок и пескосоляные смеси.</p>
        </article>
      </main>
    </div>
  </div>
</template>

<style scoped>
.content {
  max-width: 1200px;
  margin: 0 auto;
}

main{
  margin:0 13px 200px 13px;
}

h1{
  font-size: 41px;
  margin-bottom: 20px;
}

h2{
  font-size: 41px;
}

p{
  margin-top: 16px;
  font-size: 18px;
  line-height: 22px;
}

article + article{
  margin-top: 22px;
}

@media (max-width: 1024px) {
  .content {
    max-width: 850px;
  }
  h1{
    font-size: 38px;
    margin-bottom: 18px;
  }
  h2{
    font-size: 38px;
  }
  p{
    margin-top: 14px;
    font-size: 16px;
    line-height: 20px;
  }
}

@media (max-width: 768px) {
  .content {
    max-width: 650px;
  }
  h1{
    font-size: 31px;
    margin-bottom: 18px;
  }
  h2{
    font-size: 31px;
  }
}

@media (max-width: 425px) {
  .content {
    max-width: 380px;
  }
  h1{
    font-size: 28px;
    margin-bottom: 16px;
  }
  h2{
    font-size: 28px;
  }
  p{
    font-size: 12px;
  }
}
</style>